In [1]:
import pandas as pd
import numpy as np

In [7]:
file_school_data = "Resources/schools_complete.csv"
file_student_data = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(file_school_data)
student_data = pd.read_csv(file_student_data)

# Combine the data into a single dataset
combined_df = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [3]:
district_summary = pd.DataFrame({"Total Schools":[combined_df['School ID'].nunique()],
    "Total Students":["{:,}".format(combined_df["Student ID"].nunique())],
    "Total Budget":["${0:,.2f}".format(school_data["budget"].sum())],
    "Average Math Score":["{0:.2f}".format(combined_df["math_score"].mean())],
    "Average Reading Score":["{0:.2f}".format(combined_df["reading_score"].mean())],
    "% Passing Math":["{0:.2%}".format(combined_df[combined_df["math_score"] > 70]["Student ID"].nunique()/combined_df["Student ID"].nunique())],
    "% Passing Reading":["{0:.2%}".format(combined_df[combined_df["reading_score"] > 70]["Student ID"].nunique()/combined_df["Student ID"].nunique())
],
    "% Overall Passing Rate":["{0:.2%}".format(combined_df[(combined_df["math_score"] > 70) & (combined_df["reading_score"] > 70)]["Student ID"].nunique()/combined_df["Student ID"].nunique())]})


district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.99,81.88,72.39%,82.97%,60.80%

In [14]:
school_summary = pd.DataFrame({"School Name":combined_df["school_name"].unique(),
        "School Type":school_data[["school_name","type"]]["type"],
        "Total Students":school_data[["school_name","size"]]["size"],
        "Per Student Budget":school_data["budget"]/school_data["size"],
        "Average Math Score":combined_df.groupby("school_name").mean()["math_score"].values,
        "Average Reading Score":combined_df.groupby("school_name").mean()["reading_score"].values,
                               
        "Overall Passing Rate":(combined_df.groupby("school_name").mean()["math_score"].values + \
                                combined_df.groupby("school_name").mean()["reading_score"].values)/2
})

school_summary["Total Students"] = school_summary["Total Students"].map("{:,}".format)
school_summary["Per Student Budget"] = school_summary["Per Student Budget"].map("${:,.2f}".format)
school_summary["Average Math Score"] = school_summary["Average Math Score"].map("{:.2f}".format)
school_summary["Average Reading Score"] = school_summary["Average Reading Score"].map("{:.2f}".format)
school_summary["Overall Passing Rate"] = school_summary["Overall Passing Rate"].map("{:.2f}".format)
school_summary


   
# combined_df.groupby("school_name").sum()["math_score"]/combined_df.groupby("school_name")["Student ID"].count()


# combined_df[combined_df["reading_score"] > 70][["school_name","reading_score"]].groupby("school_name").count()/combined_df.groupby("school_name")["Student ID"].count().values
# school_data["budget"]/school_data["size"]

#df.loc['Total']= df.sum() EXAMPLE

passing_reading = combined_df[combined_df["reading_score"] > 70][["school_name","reading_score"]].groupby("school_name").count()
passing_math = combined_df[combined_df["math_score"] > 70][["school_name","math_score"]].groupby("school_name").count()

passing_math


# passing_math = 
passing_by_school = pd.merge(passing_reading, school_data,  on = 'school_name')
passing_by_school = pd.merge(passing_by_school, passing_math,  on = 'school_name')

passing_by_school
# # students_by_school["% Passing Reading"]=students_by_school["reading_score"]/students_by_school["size"]
# students_by_school


#TRY SERIES APPEND

,school_name,reading_score,School ID,type,size,budget,math_score
0,Bailey High School,3946,7,District,4976,3124928,3216
1,Cabrera High School,1744,6,Charter,1858,1081356,1664
2,Figueroa High School,2313,1,District,2949,1884411,1880
3,Ford High School,2123,13,District,2739,1763916,1801
4,Griffin High School,1371,4,Charter,1468,917500,1317
5,Hernandez High School,3624,3,District,4635,3022020,3001
6,Holden High School,396,8,Charter,427,248087,387
7,Huang High School,2299,0,District,2917,1910635,1847
8,Johnson High School,3727,12,District,4761,3094650,3040
9,Pena High School,887,9,Charter,962,585858,882
10,Rodriguez High School,3109,11,District,3999,2547363,2562
11,Shelton High School,1631,2,Charter,1761,1056600,1583
12,Thomas High School,1519,14,Charter,1635,1043130,1475
13,Wilson High School,2129,5,Charter,2283,1319574,2076
14,Wright High School,1682,10,Charter,1800,1049400,1625

In [7]:
passing_reading

                       reading_score
school_name
Bailey High School              3946
Cabrera High School             1744
Figueroa High School            2313
Ford High School                2123
Griffin High School             1371
Hernandez High School           3624
Holden High School               396
Huang High School               2299
Johnson High School             3727
Pena High School                 887
Rodriguez High School           3109
Shelton High School             1631
Thomas High School              1519
Wilson High School              2129
Wright High School              1682

In [217]:
school_summary.set_index("School Name").sort_values("Overall Passing Rate", ascending=False).head()

,School Type,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,,
Pena High School,Charter,962,$609.00,83.84,84.04,83.942308
Thomas High School,Charter,"1,635",$638.00,83.68,83.95,83.818611
Cabrera High School,Charter,"1,858",$582.00,83.80,83.81,83.809133
Johnson High School,District,"4,761",$650.00,83.42,83.85,83.633639
Ford High School,District,"2,739",$644.00,83.27,83.99,83.631844

In [218]:
school_summary.set_index("School Name").sort_values("Overall Passing Rate").head()

,School Type,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,,
Wright High School,Charter,"1,800",$583.00,76.84,80.74,78.793698
Bailey High School,District,"4,976",$628.00,76.63,81.18,78.906068
Hernandez High School,District,"4,635",$652.00,77.10,80.75,78.924425
Shelton High School,Charter,"1,761",$600.00,76.71,81.16,78.934893
Holden High School,Charter,427,$581.00,77.07,80.97,79.019429

In [219]:
combined_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
math_scores = combined_df[['school_name','grade','math_score']]
math_scores = pd.pivot_table(math_scores, index=['school_name','grade'], aggfunc='mean').unstack()

# math_scores.style.format({
#     '9th': '{:.2f}'.format,
#     '10th': '{:.2f}'.format,
#     '11th': '{:.2f}'.format,
#     '12th': '{:.2f}'.format
# })
math_scores.reindex(['9th','10th','11th','12th'], axis=1, level=1)

                      math_score
grade                        9th       10th       11th       12th
school_name
Bailey High School     77.083676  76.996772  77.515588  76.492218
Cabrera High School    83.094697  83.154506  82.765560  83.277487
Figueroa High School   76.403037  76.539974  76.884344  77.151369
Ford High School       77.361345  77.672316  76.918058  76.179963
Griffin High School    82.044010  84.229064  83.842105  83.356164
Hernandez High School  77.438495  77.337408  77.136029  77.186567
Holden High School     83.787402  83.429825  85.000000  82.855422
Huang High School      77.027251  75.908735  76.446602  77.225641
Johnson High School    77.187857  76.691117  77.491653  76.863248
Pena High School       83.625455  83.372000  84.328125  84.121547
Rodriguez High School  76.859966  76.612500  76.395626  77.690748
Shelton High School    83.420755  82.917411  83.383495  83.778976
Thomas High School     83.590022  83.087886  83.498795  83.497041
Wilson High School     83.085578  83.724422  83.195326  83.035794
Wright High School     83.264706  84.010288  83.836782  83.644986

In [6]:
reading_scores = combined_df[['school_name','grade','reading_score']]
reading_scores = pd.pivot_table(reading_scores, index=['school_name','grade'], aggfunc='mean').unstack()
reading_scores.reindex(['9th','10th','11th','12th'], axis=1, level=1)

                      reading_score
grade                           9th       10th       11th       12th
school_name
Bailey High School        81.303155  80.907183  80.945643  80.912451
Cabrera High School       83.676136  84.253219  83.788382  84.287958
Figueroa High School      81.198598  81.408912  80.640339  81.384863
Ford High School          80.632653  81.262712  80.403642  80.662338
Griffin High School       83.369193  83.706897  84.288089  84.013699
Hernandez High School     80.866860  80.660147  81.396140  80.857143
Holden High School        83.677165  83.324561  83.815534  84.698795
Huang High School         81.290284  81.512386  81.417476  80.305983
Johnson High School       81.260714  80.773431  80.616027  81.227564
Pena High School          83.807273  83.612000  84.335938  84.591160
Rodriguez High School     80.993127  80.629808  80.864811  80.376426
Shelton High School       84.122642  83.441964  84.373786  82.781671
Thomas High School        83.728850  84.254157  83.585542  83.831361
Wilson High School        83.939778  84.021452  83.764608  84.317673
Wright High School        83.833333  83.812757  84.156322  84.073171